Управление_торговлей.ПБТ/src/Catalogs/вт_ВариантыПроизводстваПоТехКартам/вт_ВариантыПроизводстваПоТехКартам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вт_ВариантыПроизводстваПоТехКартам</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесДетали</name>
    <comment>Вес детали необработанной</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЛитника</name>
    <comment>Вес отходов обработки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатералЛитника</name>
    <comment>Материал отходов</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПроизводстваСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПроизводстваЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <comment>Плановая расчетная себестоимость</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаСебестоимость</name>
    <type>
      <types>EnumRef.вт_ВариантРасчетаПлановойСебестоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписиСтоимости</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдИзм</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураБрака</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРецепта</name>
    <comment>Код ордера</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВведения</name>
    <comment>Дата введения рецепта</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокЗакладки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРецептов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПроцент</name>
      <comment>Если ИСТИНА, то поле Количество это проценты</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СписыватьПоВсегоИзготовлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Плановая расчетная себестоимость</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСырья</name>
      <type>
        <types>CatalogRef.ВидыСырья</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Плановая расчетная цена</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отходы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОтходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Неликвиды</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентЗакладки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_торговлей.ПБТ/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d7a580fb-b3d4-4540-9057-2bf42dbcce49">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="32c528cc-88fa-48ca-967d-eb0035bcc3a8">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/Catalogs/вт_ВариантыПроизводстваПоТехКартам/ManagerModule.bsl
Функция ПолучитьЗапасДляДерева(АдресВХран, Товар, КоличествоТовара)
	ТЗОстатки = ПолучитьИзВременногоХранилища(АдресВХран);
	Если ТЗОстатки=Неопределено ТОгда
		ТЗОстатки = Новый ТаблицаЗначений;
		ТЗОстатки.Колонки.Добавить("Номенклатура");
		ТЗОстатки.Колонки.Добавить("Запас");
		ТЗОстатки.Колонки.Добавить("НеРаспределено");
	КонецЕсли;
	
	МассивСтрок = ТЗОстатки.НайтиСтроки(Новый Структура("Номенклатура",Товар ));
	РезультатКоличество = 0;
	Если МассивСтрок.Количество()=0 Тогда
		ТЗРег = РегистрыНакопления.ТоварыНаСкладах.Остатки(ТекущаяДата(),Новый Структура("Номенклатура", Товар),"Номенклатура","ВНаличии");
		ВНаличии =ТЗРег[0].ВНаличии;
		СтрокаОстатки = ТЗОстатки.Добавить();
		СтрокаОстатки.Номенклатура = Товар;
		СтрокаОстатки.Запас = ВНаличии;
		
		РезультатКоличество = Мин(ВНаличии,КоличествоТовара);
		
		СтрокаОстатки.НеРаспределено = СтрокаОстатки.Запас - РезультатКоличество;
	Иначе
		РезультатКоличество = Мин(МассивСтрок[0].НеРаспределено,КоличествоТовара);
		МассивСтрок[0].НеРаспределено = МассивСтрок[0].НеРаспределено - РезультатКоличество;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ТЗОстатки,АдресВХран);
	
	Возврат РезультатКоличество;
	
КонецФункции

Процедура ПостроитьДеревоПроизводства(СтрокиДерева, пВариантСсылка, УникИндент="", МножительГотовойПродукции = 1) Экспорт
	
	Если ТипЗнч(пВариантСсылка) = Тип("СправочникСсылка.вт_ВариантыПроизводстваПоТехКартам") Тогда
		Для Каждого СтрокаОперации из пВариантСсылка.Операции Цикл
			СтрокаДерева = СтрокиДерева.Добавить();
			СтрокаДерева.Номенклатура = СтрокаОперации.Операция;
			СтрокаДерева.Количество = СтрокаОперации.НормаВремени;
			СтрокаДерева.Цена = СтрокаОперации.Цена;
			СтрокаДерева.Сумма = СтрокаОперации.Цена * СтрокаОперации.НормаВремени;
						
			СтрокаДерева.ЭтоРабота = Истина; 
		КонецЦикла;
		
		Для Каждого СтрокаСырье из пВариантСсылка.Состав Цикл
			СтрокаДерева = СтрокиДерева.Добавить();
			СтрокаДерева.Номенклатура = СтрокаСырье.Сырье;
			СтрокаДерева.Характеристика = СтрокаСырье.Характеристика;
			СтрокаДерева.Количество = МножительГотовойПродукции * (СтрокаСырье.Количество / пВариантСсылка.Количество);
			СтрокаДерева.Цена = СтрокаСырье.Цена;
			СтрокаДерева.Сумма = СтрокаСырье.Цена * СтрокаДерева.Количество;
			
			ЕстьРецептура           = вт_ОбщийМодульПроизводства.ПолучитьВариантПроизводстваПродукции(строкаДерева.Номенклатура).Ссылка;
			ЕстьВариантКомплектации = вт_ОбщийМодульПроизводства.ПолучитьВариантКомплектации(строкаДерева.Номенклатура).Ссылка;
			
		//	СтрокаДерева.Запас = ПолучитьЗапасДляДерева(УникИндент, СтрокаДерева.Номенклатура, СтрокаДерева.Количество);
			
			Если ЗначениеЗаполнено(ЕстьРецептура) ИЛИ ЗначениеЗаполнено(ЕстьВариантКомплектации) Тогда
				СтрокаДерева.ВариантПроизводства = ?(ЗначениеЗаполнено(ЕстьРецептура),ЕстьРецептура, ЕстьВариантКомплектации) ;
				ПостроитьДеревоПроизводства(СтрокаДерева.Строки, СтрокаДерева.ВариантПроизводства,,СтрокаДерева.Количество);
			Иначе
				СтрокаДерева.ЭтоСырье = Истина;		
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(пВариантСсылка)=Тип("СправочникСсылка.ВариантыКомплектацииНоменклатуры") Тогда
		Для Каждого СтрокаСырье из пВариантСсылка.Товары Цикл
			СтрокаДерева = СтрокиДерева.Добавить();
			СтрокаДерева.Номенклатура = СтрокаСырье.Номенклатура;
			СтрокаДерева.Характеристика = СтрокаСырье.Характеристика;
			СтрокаДерева.Количество = СтрокаСырье.КоличествоУпаковок;
			
			ЕстьРецептура           = вт_ОбщийМодульПроизводства.ПолучитьВариантПроизводстваПродукции(строкаДерева.Номенклатура).Ссылка;
			ЕстьВариантКомплектации = вт_ОбщийМодульПроизводства.ПолучитьВариантКомплектации(строкаДерева.Номенклатура).Ссылка;
			
		//	СтрокаДерева.Запас = ПолучитьЗапасДляДерева(УникИндент, СтрокаДерева.Номенклатура, СтрокаДерева.Количество);
			
			Если ЗначениеЗаполнено(ЕстьРецептура) ИЛИ ЗначениеЗаполнено(ЕстьВариантКомплектации) Тогда
				СтрокаДерева.ВариантПроизводства = ?(ЗначениеЗаполнено(ЕстьРецептура),ЕстьРецептура, ЕстьВариантКомплектации) ;
				ПостроитьДеревоПроизводства(СтрокаДерева.Строки, СтрокаДерева.ВариантПроизводства,,);
			Иначе
				СтрокаДерева.ЭтоСырье = Истина;		
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;
	
	
	
	
КонецПроцедуры
